"""
集合：
    集合是无序的，集合中的元素是唯一的。集合一般用于元组或列表中的元素去重，集合中默认去重。
    创建集合  大括号{}
        1、变量名=set(元素)    字符串/列表/元组/字典
        2、变量名={元素,元素,元素}   集合中的元素可以是元组/字符串/数字 ，不可以放列表和字典

"""
#字符串
a = set("1234")
print(a)    #{'1', '3', '4', '2'}

#列表
b = set([10,20,30])
print(b)    #{10, 20, 30}

#元组
c = set((6,7,8,9))
print(c)    #{8, 9, 6, 7}

#字典  键值对
d = {
    "年龄":18,
    "性别":"女"
}
e = set(d)
print(e)    #{'性别', '年龄'}


#用大括号{}创建集合
aa = {1,2,3,(4,5,6),"123acd"}   #{1, 2, 3, (4, 5, 6), '123acd'}
print(aa)

#bb = {[10,20,30],[3,2,1]}   #报错，集合中不能放列表
#print(bb)

#列表的去重
ss = set([1,2,1,1,1,1])
print(ss)  #{1, 2}
#元组去重
ss2 = set((1,3,1,1,3,1,3,1))
print(ss2)  #{1, 3}
#字符串去重
ss3 = set("abcabcaaabbcc")
print(ss3)  #{'c', 'b', 'a'}

sss = {1,2,3,3,2,2,2,3,1,"12333341"}  #字符串里面的内容是一个整体
print(sss)      #{1, 2, 3, '12333341'}